docs: mermaid pipeline diagram
